PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/wifi_manager/wifi_manager.c
                // Marcar como conectado
                xEventGroupClearBits(ctx->event_group, WIFI_DISCONNECTED_BIT | WIFI_CONNECT_FAIL_BIT);
                xEventGroupSetBits(ctx->event_group, WIFI_CONNECTED_BIT);
                
                // Reiniciar contador de intentos de reconexión
                ctx->reconnect_attempts = 0;
                
                // Actualizar estado
                if (ctx->state == WIFI_MANAGER_STATE_AP_MODE || 
                    ctx->state == WIFI_MANAGER_STATE_STA_AP_MODE) {
                    // Si estamos en modo AP o combinado, mantenemos ese estado
                    ctx->state = WIFI_MANAGER_STATE_STA_AP_MODE;
                } else {
                    // De lo contrario, estamos solo en modo conectado
                    ctx->state = WIFI_MANAGER_STATE_CONNECTED;
                }
                
                if (ctx->state_callback) {
                    ctx->state_callback(ctx->state, ctx->user_data);
                }
                
                // Obtener información del AP
                if (esp_wifi_sta_get_ap_info(&ctx->ap_info) != ESP_OK) {
                    ESP_LOGW(TAG, "Failed to get AP info");
                }
                break;
            }
            
            case IP_EVENT_STA_LOST_IP:
                ESP_LOGW(TAG, "Lost IP address");
                if (ctx->state != WIFI_MANAGER_STATE_STA_AP_MODE) {
                    xEventGroupClearBits(ctx->event_group, WIFI_CONNECTED_BIT);
                }
                break;
                
            default:
                // Usar %d en lugar de %" PRIi32" para evitar problemas de formato
                ESP_LOGD(TAG, "Unhandled IP event: %d", (int)event_id);
                break;
        }
    }
}

// Inicialización del WiFi Manager
esp_err_t wifi_manager_init(void)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    esp_err_t ret = ESP_OK;
    
    // Evitar inicialización múltiple
    if (ctx->event_group != NULL) {
        ESP_LOGW(TAG, "WiFi Manager already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    ESP_LOGI(TAG, "Initializing WiFi Manager");
    
    // Inicializar estado
    ctx->state = WIFI_MANAGER_STATE_INIT;
    ctx->scan_in_progress = false;
    ctx->event_group = xEventGroupCreate();
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "Failed to create event group");
        return ESP_ERR_NO_MEM;
    }
    
    // Inicializar NVS para almacenar configuración WiFi si es necesario
    ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_LOGW(TAG, "NVS needs to be erased");
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);
    
    // Inicializar TCP/IP stack
    ESP_LOGI(TAG, "Initializing TCP/IP stack");
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    
    // Crear netif para modo estación
    ESP_LOGI(TAG, "Creating WiFi station netif");
    ctx->sta_netif = esp_netif_create_default_wifi_sta();
    if (ctx->sta_netif == NULL) {
        ESP_LOGE(TAG, "Failed to create station netif");
        vEventGroupDelete(ctx->event_group);
        ctx->event_group = NULL;
        return ESP_FAIL;
    }
    
    // Crear netif para modo AP
    ESP_LOGI(TAG, "Creating WiFi AP netif");
    ctx->ap_netif = esp_netif_create_default_wifi_ap();
    if (ctx->ap_netif == NULL) {
        ESP_LOGE(TAG, "Failed to create AP netif");
        esp_netif_destroy(ctx->sta_netif);
        vEventGroupDelete(ctx->event_group);
        ctx->event_group = NULL;
        return ESP_FAIL;
    }
    
    // Configuración WiFi por defecto
    wifi_init_config_t wifi_init_config = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&wifi_init_config));
    
    // Registrar handlers de eventos
    ESP_LOGI(TAG, "Registering event handlers");
    ESP_ERROR_CHECK(esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                                       &wifi_event_handler, NULL, NULL));
    ESP_ERROR_CHECK(esp_event_handler_instance_register(IP_EVENT, ESP_EVENT_ANY_ID,
                                                       &wifi_event_handler, NULL, NULL));
    
    // Inicializar WiFi en modo estación por defecto
    ESP_LOGI(TAG, "Setting WiFi to station mode");
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_start());
    
    // Cargar credenciales guardadas
    ret = config_manager_get_str("wifi_ssid", ctx->ssid, sizeof(ctx->ssid));
    if (ret == ESP_OK) {
        ret = config_manager_get_str("wifi_password", ctx->password, sizeof(ctx->password));
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "Found saved WiFi credentials for SSID: %s", ctx->ssid);
            ctx->credentials_saved = true;
        } else {
            ctx->credentials_saved = false;
        }
    } else {
        ctx->credentials_saved = false;
    }
    
    // Configurar para escaneo
    memset(&ctx->scan_config, 0, sizeof(ctx->scan_config));
    ctx->scan_config.show_hidden = true;
    ctx->scan_config.scan_type = WIFI_SCAN_TYPE_ACTIVE;
    ctx->scan_config.scan_time.active.min = 100;
    ctx->scan_config.scan_time.active.max = 300;
    
    // Inicialización completada
    ctx->state = WIFI_MANAGER_STATE_DISCONNECTED;
    xEventGroupSetBits(ctx->event_group, WIFI_DISCONNECTED_BIT);
    
    ESP_LOGI(TAG, "WiFi Manager initialized successfully");
    return ESP_OK;
}

// Conexión a una red WiFi
esp_err_t wifi_manager_connect(const char *ssid, const char *password, bool save)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ssid == NULL) {
        ESP_LOGE(TAG, "SSID is NULL");
        return ESP_ERR_INVALID_ARG;
    }
    
    // Verificar longitud de SSID y password
    if (strlen(ssid) > 32) {
        ESP_LOGE(TAG, "SSID too long");
        return ESP_ERR_INVALID_ARG;
    }
    
