PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/wifi_manager/wifi_manager.c
    if (password != NULL && strlen(password) > 64) {
        ESP_LOGE(TAG, "Password too long");
        return ESP_ERR_INVALID_ARG;
    }
    
    ESP_LOGI(TAG, "Connecting to WiFi network: %s", ssid);
    
    // Desconectar si ya estábamos conectados en modo STA puro
    if (ctx->state == WIFI_MANAGER_STATE_CONNECTED || 
        ctx->state == WIFI_MANAGER_STATE_CONNECTING) {
        ESP_LOGI(TAG, "Disconnecting from current network before connecting to new one");
        ESP_ERROR_CHECK(esp_wifi_disconnect());
        
        // Esperar a que se desconecte
        EventBits_t bits = xEventGroupWaitBits(ctx->event_group, 
                                              WIFI_DISCONNECTED_BIT,
                                              pdFALSE, pdFALSE, pdMS_TO_TICKS(5000));
        if ((bits & WIFI_DISCONNECTED_BIT) == 0) {
            ESP_LOGW(TAG, "Timeout waiting for disconnection");
        }
    }
    
    // Guardar credenciales
    strncpy(ctx->ssid, ssid, sizeof(ctx->ssid) - 1);
    ctx->ssid[sizeof(ctx->ssid) - 1] = '\0';
    
    if (password != NULL) {
        strncpy(ctx->password, password, sizeof(ctx->password) - 1);
        ctx->password[sizeof(ctx->password) - 1] = '\0';
    } else {
        ctx->password[0] = '\0';
    }
    
    // Guardar credenciales en NVS si se solicita
    if (save) {
        ESP_LOGI(TAG, "Saving WiFi credentials");
        ESP_ERROR_CHECK(config_manager_set_str("wifi_ssid", ctx->ssid));
        ESP_ERROR_CHECK(config_manager_set_str("wifi_password", ctx->password));
        ctx->credentials_saved = true;
    }
    
    // Configurar WiFi
    wifi_config_t wifi_config = {0};
    strncpy((char *)wifi_config.sta.ssid, ctx->ssid, sizeof(wifi_config.sta.ssid) - 1);
    if (ctx->password[0] != '\0') {
        strncpy((char *)wifi_config.sta.password, ctx->password, sizeof(wifi_config.sta.password) - 1);
    }
    
    // Configurar para reconexión automática
    wifi_config.sta.scan_method = WIFI_FAST_SCAN;
    wifi_config.sta.sort_method = WIFI_CONNECT_AP_BY_SIGNAL;
    wifi_config.sta.threshold.rssi = -127;
    wifi_config.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK;
    
    // Verificar si estamos en modo AP o combinado
    wifi_mode_t current_mode;
    ESP_ERROR_CHECK(esp_wifi_get_mode(&current_mode));
    
    if (current_mode == WIFI_MODE_AP) {
        // Cambiar a modo combinado
        ESP_LOGI(TAG, "Changing from AP to STA+AP mode");
        ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_APSTA));
        ctx->state = WIFI_MANAGER_STATE_STA_AP_MODE;
    } else if (current_mode == WIFI_MODE_APSTA) {
        // Ya estamos en modo combinado, solo actualizamos la configuración STA
        ESP_LOGI(TAG, "Updating STA configuration in STA+AP mode");
    } else {
        // Asegurar que estamos en modo STA
        ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    }
    
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));
    
    // Actualizar estado
    if (ctx->state != WIFI_MANAGER_STATE_STA_AP_MODE) {
        ctx->state = WIFI_MANAGER_STATE_CONNECTING;
    }
    ctx->reconnect_attempts = 0;
    if (ctx->state_callback) {
        ctx->state_callback(ctx->state, ctx->user_data);
    }
    
    // Iniciar conexión
    ESP_ERROR_CHECK(esp_wifi_connect());
    
    // Esperar conexión con timeout
    EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                          WIFI_CONNECTED_BIT | WIFI_CONNECT_FAIL_BIT,
                                          pdFALSE, pdFALSE, pdMS_TO_TICKS(WIFI_CONNECT_TIMEOUT_MS));
    
    // Verificar resultado
    if (bits & WIFI_CONNECTED_BIT) {
        ESP_LOGI(TAG, "Successfully connected to WiFi network");
        return ESP_OK;
    } else if (bits & WIFI_CONNECT_FAIL_BIT) {
        ESP_LOGE(TAG, "Failed to connect to WiFi network");
        // Solo actualizamos el estado si no estamos en modo combinado
        if (ctx->state != WIFI_MANAGER_STATE_STA_AP_MODE) {
            ctx->state = WIFI_MANAGER_STATE_ERROR;
            if (ctx->state_callback) {
                ctx->state_callback(ctx->state, ctx->user_data);
            }
        }
        return ESP_FAIL;
    } else {
        ESP_LOGW(TAG, "Connection attempt timed out");
        // Solo actualizamos el estado si no estamos en modo combinado
        if (ctx->state != WIFI_MANAGER_STATE_STA_AP_MODE) {
            ctx->state = WIFI_MANAGER_STATE_ERROR;
            if (ctx->state_callback) {
                ctx->state_callback(ctx->state, ctx->user_data);
            }
        }
        return ESP_ERR_TIMEOUT;
    }
}

// Conexión usando credenciales guardadas
esp_err_t wifi_manager_connect_saved(void)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (!ctx->credentials_saved) {
        ESP_LOGW(TAG, "No saved WiFi credentials");
        return ESP_ERR_NOT_FOUND;
    }
    
    ESP_LOGI(TAG, "Connecting with saved credentials, SSID: %s", ctx->ssid);
    return wifi_manager_connect(ctx->ssid, ctx->password, false);
}

// Desconexión de la red WiFi
esp_err_t wifi_manager_disconnect(void)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ctx->state != WIFI_MANAGER_STATE_CONNECTED && 
        ctx->state != WIFI_MANAGER_STATE_CONNECTING &&
        ctx->state != WIFI_MANAGER_STATE_STA_AP_MODE) {
        ESP_LOGW(TAG, "Not connected to WiFi");
        return ESP_ERR_INVALID_STATE;
    }
    
    ESP_LOGI(TAG, "Disconnecting from WiFi network: %s", ctx->ssid);
    ESP_ERROR_CHECK(esp_wifi_disconnect());
    
    // Si estamos en modo combinado, solo desconectamos la parte STA pero mantenemos el AP
    if (ctx->state == WIFI_MANAGER_STATE_STA_AP_MODE) {
        ESP_LOGI(TAG, "Remaining in AP mode after STA disconnection");
        ctx->state = WIFI_MANAGER_STATE_AP_MODE;
        if (ctx->state_callback) {
            ctx->state_callback(ctx->state, ctx->user_data);
        }
        return ESP_OK;
    }
    
