PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/wifi_manager/wifi_manager.c
    // Para otros modos, esperamos la desconexión completa
    EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                          WIFI_DISCONNECTED_BIT,
                                          pdFALSE, pdFALSE, pdMS_TO_TICKS(5000));
    
    if (bits & WIFI_DISCONNECTED_BIT) {
        ESP_LOGI(TAG, "Successfully disconnected from WiFi");
        return ESP_OK;
    } else {
        ESP_LOGW(TAG, "Timeout waiting for disconnection");
        return ESP_ERR_TIMEOUT;
    }
}

// Iniciar modo Access Point
esp_err_t wifi_manager_start_ap_mode(const char *ap_ssid, const char *ap_password)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ap_ssid == NULL) {
        ESP_LOGE(TAG, "AP SSID is NULL");
        return ESP_ERR_INVALID_ARG;
    }
    
    // Verificar longitud de SSID y password
    if (strlen(ap_ssid) > 32) {
        ESP_LOGE(TAG, "AP SSID too long");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (ap_password != NULL && strlen(ap_password) > 64) {
        ESP_LOGE(TAG, "AP Password too long");
        return ESP_ERR_INVALID_ARG;
    }
    
    ESP_LOGI(TAG, "Starting WiFi Access Point: %s", ap_ssid);
    
    // Desconectar si estábamos en modo estación
    if (ctx->state == WIFI_MANAGER_STATE_CONNECTED || 
        ctx->state == WIFI_MANAGER_STATE_CONNECTING) {
        ESP_LOGI(TAG, "Disconnecting from current network before starting AP");
        ESP_ERROR_CHECK(esp_wifi_disconnect());
        
        // Esperar a que se desconecte
        EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                              WIFI_DISCONNECTED_BIT,
                                              pdFALSE, pdFALSE, pdMS_TO_TICKS(5000));
        if ((bits & WIFI_DISCONNECTED_BIT) == 0) {
            ESP_LOGW(TAG, "Timeout waiting for disconnection");
        }
    }
    
    // Guardar configuración AP
    strncpy(ctx->ap_ssid, ap_ssid, sizeof(ctx->ap_ssid) - 1);
    ctx->ap_ssid[sizeof(ctx->ap_ssid) - 1] = '\0';
    
    if (ap_password != NULL) {
        strncpy(ctx->ap_password, ap_password, sizeof(ctx->ap_password) - 1);
        ctx->ap_password[sizeof(ctx->ap_password) - 1] = '\0';
    } else {
        ctx->ap_password[0] = '\0';
    }
    
    // Configurar modo AP
    wifi_config_t ap_config = {0};
    strncpy((char *)ap_config.ap.ssid, ctx->ap_ssid, sizeof(ap_config.ap.ssid) - 1);
    ap_config.ap.ssid_len = strlen(ctx->ap_ssid);
    
    if (ctx->ap_password[0] != '\0' && strlen(ctx->ap_password) >= 8) {
        strncpy((char *)ap_config.ap.password, ctx->ap_password, sizeof(ap_config.ap.password) - 1);
        ap_config.ap.authmode = WIFI_AUTH_WPA2_PSK;
    } else {
        ap_config.ap.authmode = WIFI_AUTH_OPEN;
    }
    
    ap_config.ap.max_connection = 4;
    ap_config.ap.beacon_interval = 100;
    
    // Cambiar a modo AP
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_AP));
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_AP, &ap_config));
    
    // Esperar a que el AP inicie
    EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                          WIFI_AP_STARTED_BIT,
                                          pdFALSE, pdFALSE, pdMS_TO_TICKS(5000));
    
    if (bits & WIFI_AP_STARTED_BIT) {
        ESP_LOGI(TAG, "WiFi Access Point started successfully");
        return ESP_OK;
    } else {
        ESP_LOGW(TAG, "Timeout waiting for AP to start");
        return ESP_ERR_TIMEOUT;
    }
}

// Iniciar modo combinado STA+AP
esp_err_t wifi_manager_start_sta_ap_mode(const char *ap_ssid, const char *ap_password)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ap_ssid == NULL) {
        ESP_LOGE(TAG, "AP SSID is NULL");
        return ESP_ERR_INVALID_ARG;
    }
    
    // Verificar longitud de SSID y password
    if (strlen(ap_ssid) > 32) {
        ESP_LOGE(TAG, "AP SSID too long");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (ap_password != NULL && strlen(ap_password) > 64) {
        ESP_LOGE(TAG, "AP Password too long");
        return ESP_ERR_INVALID_ARG;
    }
    
    ESP_LOGI(TAG, "Starting WiFi STA+AP mode with AP: %s", ap_ssid);
    
    // Guardar configuración AP
    strncpy(ctx->ap_ssid, ap_ssid, sizeof(ctx->ap_ssid) - 1);
    ctx->ap_ssid[sizeof(ctx->ap_ssid) - 1] = '\0';
    
    if (ap_password != NULL) {
        strncpy(ctx->ap_password, ap_password, sizeof(ctx->ap_password) - 1);
        ctx->ap_password[sizeof(ctx->ap_password) - 1] = '\0';
    } else {
        ctx->ap_password[0] = '\0';
    }
    
    // Configurar modo AP
    wifi_config_t ap_config = {0};
    strncpy((char *)ap_config.ap.ssid, ctx->ap_ssid, sizeof(ap_config.ap.ssid) - 1);
    ap_config.ap.ssid_len = strlen(ctx->ap_ssid);
    
    if (ctx->ap_password[0] != '\0' && strlen(ctx->ap_password) >= 8) {
        strncpy((char *)ap_config.ap.password, ctx->ap_password, sizeof(ap_config.ap.password) - 1);
        ap_config.ap.authmode = WIFI_AUTH_WPA2_PSK;
    } else {
        ap_config.ap.authmode = WIFI_AUTH_OPEN;
    }
    
    ap_config.ap.max_connection = 4;
    ap_config.ap.beacon_interval = 100;
    
    // Cambiar a modo combinado
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_APSTA));
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_AP, &ap_config));
    
    // Si hay credenciales guardadas, intentar conectar en modo STA
    if (ctx->credentials_saved) {
        // Configurar WiFi STA
        wifi_config_t sta_config = {0};
        strncpy((char *)sta_config.sta.ssid, ctx->ssid, sizeof(sta_config.sta.ssid) - 1);
        if (ctx->password[0] != '\0') {
            strncpy((char *)sta_config.sta.password, ctx->password, sizeof(sta_config.sta.password) - 1);
        }
        
        // Configurar para reconexión automática
        sta_config.sta.scan_method = WIFI_FAST_SCAN;
        sta_config.sta.sort_method = WIFI_CONNECT_AP_BY_SIGNAL;
        sta_config.sta.threshold.rssi = -127;
        sta_config.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK;
        
        ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &sta_config));
        
