PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/wifi_manager/wifi_manager.c
        // Iniciar conexión
        ESP_LOGI(TAG, "Trying to connect to WiFi: %s in STA+AP mode", ctx->ssid);
        ESP_ERROR_CHECK(esp_wifi_connect());
    }
    
    // Esperar a que el AP inicie
    EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                          WIFI_AP_STARTED_BIT,
                                          pdFALSE, pdFALSE, pdMS_TO_TICKS(5000));
    
    if (bits & WIFI_AP_STARTED_BIT) {
        ctx->state = WIFI_MANAGER_STATE_STA_AP_MODE;
        if (ctx->state_callback) {
            ctx->state_callback(ctx->state, ctx->user_data);
        }
        ESP_LOGI(TAG, "WiFi STA+AP mode started successfully");
        return ESP_OK;
    } else {
        ESP_LOGW(TAG, "Timeout waiting for AP to start in STA+AP mode");
        return ESP_ERR_TIMEOUT;
    }
}

// Detener modo Access Point
esp_err_t wifi_manager_stop_ap_mode(void)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ctx->state != WIFI_MANAGER_STATE_AP_MODE && 
        ctx->state != WIFI_MANAGER_STATE_STA_AP_MODE) {
        ESP_LOGW(TAG, "Not in AP or STA+AP mode");
        return ESP_ERR_INVALID_STATE;
    }
    
    ESP_LOGI(TAG, "Stopping WiFi Access Point");
    
    // Si estamos en modo combinado y conectados, cambiar a modo STA
    // Si no, cambiar a modo desconectado
    if (ctx->state == WIFI_MANAGER_STATE_STA_AP_MODE && 
        (xEventGroupGetBits(ctx->event_group) & WIFI_CONNECTED_BIT)) {
        ESP_LOGI(TAG, "Switching from STA+AP to STA mode");
        ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
        ctx->state = WIFI_MANAGER_STATE_CONNECTED;
    } else {
        ESP_LOGI(TAG, "Switching to STA mode (disconnected)");
        ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
        ctx->state = WIFI_MANAGER_STATE_DISCONNECTED;
    }
    
    if (ctx->state_callback) {
        ctx->state_callback(ctx->state, ctx->user_data);
    }
    
    return ESP_OK;
}

esp_err_t wifi_manager_set_sta_mode(void) {
    ESP_LOGI(TAG, "Switching to station-only mode");
    
    // Desconectar y detener AP
    wifi_manager_stop_ap_mode();
    
    // Cambiar a modo station
    esp_err_t ret = esp_wifi_set_mode(WIFI_MODE_STA);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to set WiFi mode: %s", esp_err_to_name(ret));
        return ret;
    }
    
    return ESP_OK;
}

// Verificar si está conectado a WiFi
bool wifi_manager_is_connected(void)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return false;
    }
    
    EventBits_t bits = xEventGroupGetBits(ctx->event_group);
    return (bits & WIFI_CONNECTED_BIT) != 0;
}

// Obtener la dirección IP en modo STA
esp_err_t wifi_manager_get_ip(char *ip, size_t max_len)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ip == NULL || max_len < 16) {
        ESP_LOGE(TAG, "Invalid buffer for IP address");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (!wifi_manager_is_connected()) {
        ESP_LOGW(TAG, "Not connected to WiFi");
        strncpy(ip, "0.0.0.0", max_len);
        return ESP_ERR_INVALID_STATE;
    }
    
    // Obtener información IP
    esp_netif_ip_info_t ip_info;
    ESP_ERROR_CHECK(esp_netif_get_ip_info(ctx->sta_netif, &ip_info));
    
    // Convertir a string
    snprintf(ip, max_len, IPSTR, IP2STR(&ip_info.ip));
    return ESP_OK;
}

// Obtener IP del Access Point
esp_err_t wifi_manager_get_ap_ip(char *ip, size_t max_len)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ip == NULL || max_len < 16) {
        ESP_LOGE(TAG, "Invalid buffer for IP address");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (ctx->state != WIFI_MANAGER_STATE_AP_MODE && 
        ctx->state != WIFI_MANAGER_STATE_STA_AP_MODE) {
        ESP_LOGW(TAG, "Not in AP or STA+AP mode");
        strncpy(ip, "0.0.0.0", max_len);
        return ESP_ERR_INVALID_STATE;
    }
    
    // Obtener información IP del AP
    esp_netif_ip_info_t ip_info;
    ESP_ERROR_CHECK(esp_netif_get_ip_info(ctx->ap_netif, &ip_info));
    
    // Convertir a string
    snprintf(ip, max_len, IPSTR, IP2STR(&ip_info.ip));
    return ESP_OK;
}

// Obtener el RSSI actual
esp_err_t wifi_manager_get_rssi(int8_t *rssi)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (rssi == NULL) {
        ESP_LOGE(TAG, "RSSI pointer is NULL");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (!wifi_manager_is_connected()) {
        ESP_LOGW(TAG, "Not connected to WiFi");
        *rssi = -127;
        return ESP_ERR_INVALID_STATE;
    }
    
    // Actualizar información AP
    if (esp_wifi_sta_get_ap_info(&ctx->ap_info) != ESP_OK) {
        ESP_LOGW(TAG, "Failed to get AP info");
        *rssi = -127;
        return ESP_FAIL;
    }
    
    *rssi = ctx->ap_info.rssi;
    return ESP_OK;
}

// Obtener el estado actual
wifi_manager_state_t wifi_manager_get_state(void)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return WIFI_MANAGER_STATE_INIT;
    }
    
    return ctx->state;
}

// Obtener el SSID configurado
esp_err_t wifi_manager_get_configured_ssid(char *ssid, size_t max_len)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ssid == NULL || max_len < 1) {
        ESP_LOGE(TAG, "Invalid buffer for SSID");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (!ctx->credentials_saved) {
        ESP_LOGW(TAG, "No saved WiFi credentials");
        ssid[0] = '\0';
        return ESP_ERR_NOT_FOUND;
    }
    
    strncpy(ssid, ctx->ssid, max_len - 1);
    ssid[max_len - 1] = '\0';
    
    return ESP_OK;
}

// Olvidar red WiFi guardada
esp_err_t wifi_manager_forget_network(void)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
