PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/wifi_manager/wifi_manager.c
    ESP_LOGI(TAG, "Forgetting saved WiFi network");
    
    // Desconectar si estamos conectados
    if (ctx->state == WIFI_MANAGER_STATE_CONNECTED || 
        ctx->state == WIFI_MANAGER_STATE_CONNECTING) {
        ESP_LOGI(TAG, "Disconnecting from current network");
        ESP_ERROR_CHECK(esp_wifi_disconnect());
        
        // Esperar a que se desconecte
        EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                              WIFI_DISCONNECTED_BIT,
                                              pdFALSE, pdFALSE, pdMS_TO_TICKS(5000));
        if ((bits & WIFI_DISCONNECTED_BIT) == 0) {
            ESP_LOGW(TAG, "Timeout waiting for disconnection");
        }
    }
    
    // Borrar credenciales de config_manager
    ESP_ERROR_CHECK(config_manager_erase_key("wifi_ssid"));
    ESP_ERROR_CHECK(config_manager_erase_key("wifi_password"));
    
    // Limpiar variables internas
    ctx->ssid[0] = '\0';
    ctx->password[0] = '\0';
    ctx->credentials_saved = false;
    
    // Si estamos en modo combinado, mantener el modo AP
    if (ctx->state == WIFI_MANAGER_STATE_STA_AP_MODE) {
        ctx->state = WIFI_MANAGER_STATE_AP_MODE;
    } else {
        ctx->state = WIFI_MANAGER_STATE_DISCONNECTED;
    }
    
    if (ctx->state_callback) {
        ctx->state_callback(ctx->state, ctx->user_data);
    }
    
    return ESP_OK;
}

// Iniciar escaneo de redes WiFi
esp_err_t wifi_manager_start_scan(void)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    ESP_LOGI(TAG, "Starting WiFi scan");
    
    // Limpiar bits de escaneo previo
    xEventGroupClearBits(ctx->event_group, WIFI_SCAN_DONE_BIT);
    
    // Marcar como escaneo en progreso
    ctx->scan_in_progress = true;
    
    // Iniciar escaneo
    ESP_ERROR_CHECK(esp_wifi_scan_start(&ctx->scan_config, false));
    
    return ESP_OK;
}

// Obtener resultados del escaneo
esp_err_t wifi_manager_get_scan_results(wifi_scan_result_t *results, size_t max_networks, size_t *num_networks)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (results == NULL || num_networks == NULL) {
        ESP_LOGE(TAG, "Invalid output parameters");
        return ESP_ERR_INVALID_ARG;
    }
    
    // Verificar si hay un escaneo en curso
    ESP_ERROR_CHECK(esp_wifi_scan_get_ap_num(&ctx->scan_ap_count));
    bool scan_done = !ctx->scan_in_progress;
    
    if (!scan_done) {
        ESP_LOGI(TAG, "Waiting for scan to complete");
        
        // Esperar a que termine el escaneo
        EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                              WIFI_SCAN_DONE_BIT,
                                              pdFALSE, pdFALSE, pdMS_TO_TICKS(10000));
        
        if ((bits & WIFI_SCAN_DONE_BIT) == 0) {
            ESP_LOGW(TAG, "Timeout waiting for scan to complete");
            return ESP_ERR_TIMEOUT;
        }
    }
    
    // Verificar si hay resultados de escaneo
    if (ctx->scan_ap_list == NULL || ctx->scan_ap_count == 0) {
        ESP_LOGW(TAG, "No scan results available");
        *num_networks = 0;
        return ESP_ERR_NOT_FOUND;
    }
    
    // Copiar resultados
    size_t count = (ctx->scan_ap_count < max_networks) ? ctx->scan_ap_count : max_networks;
    for (size_t i = 0; i < count; i++) {
        strncpy(results[i].ssid, (char *)ctx->scan_ap_list[i].ssid, sizeof(results[i].ssid) - 1);
        results[i].ssid[sizeof(results[i].ssid) - 1] = '\0';
        results[i].rssi = ctx->scan_ap_list[i].rssi;
        results[i].auth_mode = ctx->scan_ap_list[i].authmode;
    }
    
    *num_networks = count;
    return ESP_OK;
}

// Registrar callback para cambios de estado
esp_err_t wifi_manager_set_state_callback(void (*callback)(wifi_manager_state_t state, void *user_data), void *user_data)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    ctx->state_callback = callback;
    ctx->user_data = user_data;
    
    return ESP_OK;
}

/**
 * @brief Maneja la pérdida de conexión WiFi, intentando reconectar y activando el modo AP si falla
 * 
 * Esta función debe ser llamada periódicamente desde el bucle principal cuando
 * se detecta que el WiFi está desconectado.
 * 
 * @param ap_ssid_prefix Prefijo para el SSID del AP (se añadirá el ID del dispositivo)
 * @param ap_password Contraseña para el AP
 * @param max_attempts Número máximo de intentos de reconexión antes de activar el AP
 * @return ESP_OK si está gestionando correctamente, ESP_FAIL en caso de error crítico
 */
esp_err_t wifi_manager_handle_disconnection(const char *ap_ssid_prefix, const char *ap_password, int max_attempts) {
    static int reconnect_attempts = 0;
    static int64_t last_reconnect_time = 0;
    int64_t current_time = esp_timer_get_time() / 1000;  // Convertir a ms
    
    // Si WiFi ya está conectado, resetear contador y salir
    if (wifi_manager_is_connected()) {
        reconnect_attempts = 0;
        return ESP_OK;
    }
    
    // Si han pasado al menos 10 segundos desde el último intento
    if (current_time - last_reconnect_time > 10000) {
        last_reconnect_time = current_time;
        
        // Incrementar contador de intentos
        reconnect_attempts++;
        ESP_LOGI(TAG, "WiFi disconnected, reconnection attempt %d/%d", 
                 reconnect_attempts, max_attempts);
        
        // Intentar reconectar con credenciales guardadas
        esp_err_t ret = wifi_manager_connect_saved();
        
        // Si hemos alcanzado el número máximo de intentos y sigue fallando
        if (reconnect_attempts >= max_attempts && ret != ESP_OK) {
            ESP_LOGI(TAG, "Failed to reconnect to WiFi after %d attempts, activating AP mode", 
                     reconnect_attempts);
            
            // Generar SSID único para el AP
            char ap_ssid[33];
            esp_err_t ap_ret = wifi_manager_generate_ap_ssid(ap_ssid, sizeof(ap_ssid), ap_ssid_prefix);
            if (ap_ret != ESP_OK) {
                ESP_LOGE(TAG, "Failed to generate AP SSID");
                return ESP_FAIL;
            }
            
            // Iniciar AP y portal cautivo
            ESP_LOGI(TAG, "Starting AP with SSID: %s", ap_ssid);
            
