PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/wifi_manager/wifi_manager.c
            // Iniciar AP
            ap_ret = wifi_manager_start_ap_mode(ap_ssid, ap_password);
            if (ap_ret != ESP_OK) {
                ESP_LOGE(TAG, "Failed to start AP mode");
                return ESP_FAIL;
            }
            
            // Iniciar portal cautivo (esto es opcional, depende de tu implementación)
            // Si tu aplicación tiene el módulo wifi_captive_portal, puedes llamarlo así:
            // wifi_captive_portal_start(ap_ssid, ap_password);
            
            // Resetear contador de intentos
            reconnect_attempts = 0;
        }
    }
    
    return ESP_OK;
}

// Generar SSID único para AP basado en ID del dispositivo
esp_err_t wifi_manager_generate_ap_ssid(char *ap_ssid, size_t max_len, const char *prefix)
{
    if (ap_ssid == NULL || max_len < 8 || prefix == NULL) {
        ESP_LOGE(TAG, "Invalid parameters for AP SSID generation");
        return ESP_ERR_INVALID_ARG;
    }
    
    // Obtener el ID del ESP32
    char esp32_id[ESP32_ID_LENGTH + 1];
    esp_err_t ret = esp32_id_manager_get_id(esp32_id, sizeof(esp32_id));
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to get ESP32 ID");
        return ret;
    }
    
    // Generar SSID con formato: PREFIX_ABCDEF (últimos 6 caracteres del ID)
    size_t id_len = strlen(esp32_id);
    size_t prefix_len = strlen(prefix);
    
    if (id_len < 6 || prefix_len + 7 > max_len) {
        ESP_LOGE(TAG, "ID too short or buffer too small");
        return ESP_ERR_INVALID_ARG;
    }
    
    snprintf(ap_ssid, max_len, "%s_%s", prefix, &esp32_id[id_len - 6]);
    
    ESP_LOGI(TAG, "Generated AP SSID: %s", ap_ssid);
    return ESP_OK;
}